In [1]:
%pip install jupysql duckdb-engine --quiet
#Run in jupyter notebook from "https://jupysql.ploomber.io/en/latest/quick-start.html#"
#https://github.com/catherinedevlin/ipython-sql?tab=readme-ov-file

Note: you may need to restart the kernel to use updated packages.

WARNING: Ignoring invalid distribution ~atplotlib (C:\Users\qy\miniconda3\Lib\site-packages)
WARNING: Ignoring invalid distribution ~atplotlib (C:\Users\qy\miniconda3\Lib\site-packages)
WARNING: Ignoring invalid distribution ~atplotlib (C:\Users\qy\miniconda3\Lib\site-packages)

#Load SQL extension

In [2]:
%load_ext sql

In [3]:
%sql sqlite://

Connecting to 'sqlite://'

#SQL Lab

%sql for single lines of SQL commands, %%SQL for multiple lines of SQL commands

## CREATE, ALTER, TRUNCATE, DROP

In [4]:
%%sql
CREATE TABLE PETSALE (
        ID INTEGER NOT NULL,
        PET CHAR(20),
        SALEPRICE DECIMAL(6,2),
        PROFIT DECIMAL(6,2),
        SALEDATE DATE
        );

CREATE TABLE PET (
        ID INTEGER NOT NULL,
        ANIMAL VARCHAR(20),
        QUANTITY INTEGER
        );

Running query in 'sqlite://'

++
||
++
++

In [5]:
%%sql

INSERT INTO PETSALE VALUES
        (1,'Cat',450.09,100.47,'2018-05-29'),
        (2,'Dog',666.66,150.76,'2018-06-01'),
        (3,'Parrot',50.00,8.9,'2018-06-04'),
        (4,'Hamster',60.60,12,'2018-06-11'),
        (5,'Goldfish',48.48,3.5,'2018-06-14');

INSERT INTO PET VALUES
        (1,'Cat',3),
        (2,'Dog',4),
        (3,'Hamster',2);

SELECT * FROM PETSALE;
SELECT * FROM PET;

Running query in 'sqlite://'

5 rows affected.

3 rows affected.

+----+---------+----------+
| ID |  ANIMAL | QUANTITY |
+----+---------+----------+
| 1  |   Cat   |    3     |
| 2  |   Dog   |    4     |
| 3  | Hamster |    2     |
+----+---------+----------+

In [6]:
%%sql

ALTER TABLE PETSALE
ADD COLUMN QUANTITY INTEGER;

SELECT * FROM PETSALE;

Running query in 'sqlite://'

+----+----------+-----------+--------+------------+----------+
| ID |   PET    | SALEPRICE | PROFIT |  SALEDATE  | QUANTITY |
+----+----------+-----------+--------+------------+----------+
| 1  |   Cat    |   450.09  | 100.47 | 2018-05-29 |   None   |
| 2  |   Dog    |   666.66  | 150.76 | 2018-06-01 |   None   |
| 3  |  Parrot  |     50    |  8.9   | 2018-06-04 |   None   |
| 4  | Hamster  |    60.6   |   12   | 2018-06-11 |   None   |
| 5  | Goldfish |   48.48   |  3.5   | 2018-06-14 |   None   |
+----+----------+-----------+--------+------------+----------+

In [7]:
%%sql
UPDATE PETSALE SET QUANTITY = 9 WHERE ID = 1;
UPDATE PETSALE SET QUANTITY = 3 WHERE ID = 2;
UPDATE PETSALE SET QUANTITY = 2 WHERE ID = 3;
UPDATE PETSALE SET QUANTITY = 6 WHERE ID = 4;
UPDATE PETSALE SET QUANTITY = 24 WHERE ID = 5;

SELECT * FROM PETSALE;

Running query in 'sqlite://'

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

+----+----------+-----------+--------+------------+----------+
| ID |   PET    | SALEPRICE | PROFIT |  SALEDATE  | QUANTITY |
+----+----------+-----------+--------+------------+----------+
| 1  |   Cat    |   450.09  | 100.47 | 2018-05-29 |    9     |
| 2  |   Dog    |   666.66  | 150.76 | 2018-06-01 |    3     |
| 3  |  Parrot  |     50    |  8.9   | 2018-06-04 |    2     |
| 4  | Hamster  |    60.6   |   12   | 2018-06-11 |    6     |
| 5  | Goldfish |   48.48   |  3.5   | 2018-06-14 |    24    |
+----+----------+-----------+--------+------------+----------+

In [8]:
%%sql
ALTER TABLE PETSALE
DROP COLUMN PROFIT;

SELECT * FROM PETSALE;

Running query in 'sqlite://'

+----+----------+-----------+------------+----------+
| ID |   PET    | SALEPRICE |  SALEDATE  | QUANTITY |
+----+----------+-----------+------------+----------+
| 1  |   Cat    |   450.09  | 2018-05-29 |    9     |
| 2  |   Dog    |   666.66  | 2018-06-01 |    3     |
| 3  |  Parrot  |     50    | 2018-06-04 |    2     |
| 4  | Hamster  |    60.6   | 2018-06-11 |    6     |
| 5  | Goldfish |   48.48   | 2018-06-14 |    24    |
+----+----------+-----------+------------+----------+

In [11]:
%%sql

--ALTER TABLE PETSALE
--MODIFY PET VARCHAR(20); #modify datatypes
SELECT * FROM PETSALE;

Running query in 'sqlite://'

+----+----------+-----------+------------+----------+
| ID |   PET    | SALEPRICE |  SALEDATE  | QUANTITY |
+----+----------+-----------+------------+----------+
| 1  |   Cat    |   450.09  | 2018-05-29 |    9     |
| 2  |   Dog    |   666.66  | 2018-06-01 |    3     |
| 3  |  Parrot  |     50    | 2018-06-04 |    2     |
| 4  | Hamster  |    60.6   | 2018-06-11 |    6     |
| 5  | Goldfish |   48.48   | 2018-06-14 |    24    |
+----+----------+-----------+------------+----------+

In [12]:
%%sql
--ALTER TABLE `PETSALE`
--CHANGE `PET` `ANIMAL` varchar(20);  #Rename the column PET to ANIMAL

SELECT * FROM PETSALE;

Running query in 'sqlite://'

+----+----------+-----------+------------+----------+
| ID |   PET    | SALEPRICE |  SALEDATE  | QUANTITY |
+----+----------+-----------+------------+----------+
| 1  |   Cat    |   450.09  | 2018-05-29 |    9     |
| 2  |   Dog    |   666.66  | 2018-06-01 |    3     |
| 3  |  Parrot  |     50    | 2018-06-04 |    2     |
| 4  | Hamster  |    60.6   | 2018-06-11 |    6     |
| 5  | Goldfish |   48.48   | 2018-06-14 |    24    |
+----+----------+-----------+------------+----------+

In [13]:
%%sql
--TRUNCATE TABLE PET; #remove all rows from an existing table without deleting it

SELECT * FROM PET;

Running query in 'sqlite://'

+----+---------+----------+
| ID |  ANIMAL | QUANTITY |
+----+---------+----------+
| 1  |   Cat   |    3     |
| 2  |   Dog   |    4     |
| 3  | Hamster |    2     |
+----+---------+----------+

In [14]:
%%sql
DROP TABLE PET;

SELECT * FROM PET;

Running query in 'sqlite://'

RuntimeError: If using snippets, you may pass the --with argument explicitly.
For more details please refer: https://jupysql.ploomber.io/en/latest/compose.html#with-argument


Original error message from DB driver:
(sqlite3.OperationalError) no such table: PET
[SQL: SELECT * FROM PET;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

no table pet so error.